/**
 * 二维向量
 * 只需要在平面直角坐标系中
 * 确定原点O(0,0)，P(x,y)
 * 画一条从O指向P的有方向的线，这就是一条向量，在坐标系中可以用P(x,y)代指该向量。
 * 向量可以平移
 * 单位向量的长度为1.
 * */
// 向量加法：p = m + n = (m.x + n.x, m.y + n.y)
let m = { x: 1, y: 2 }
let n = { x: 2, y: 3 }
let p = {
    x: m.x + n.x,
    y: m.y + n.y
}
// 向量减法：p = m - n = (m.x - n.x, m.y - n.y)
m = { x: 1, y: 2 }
n = { x: 4, y: 1 }
p = {
    x: m.x - n.x,
    y: m.y - n.y
}
// 设向量m,n 夹角q，m * n > 0 则 q的度数 > 0,反之< 0 ,= 0 则m,n 垂直
// 点积：p = m * n = m.x * n.x + m.y * n.y;
m = { x: 1, y: 2 }
n = { x: 4, y: 1 }
p = m.x * n.x + m.y * n.y;
